In [1]:
import numpy as np
import pandas as pd

In [3]:
prenoms = ['liz', 'bob', 'bill', 'eve']

In [5]:
age = pd.Series([25, 30, 35, 40], index=prenoms)

In [7]:
taille = pd.Series([160, 175, 170, 180], index=prenoms)

In [9]:
sexe = pd.Series(list('fhhf'), index=prenoms)

In [11]:
list('fhhf')

['f', 'h', 'h', 'f']

In [19]:
df = pd.DataFrame({'age': age,
                   'taile': taille,
                  'sexe': sexe})

In [21]:
df

      age  taile sexe
liz    25    160    f
bob    30    175    h
bill   35    170    h
eve    40    180    f

In [23]:
df.index

Index(['liz', 'bob', 'bill', 'eve'], dtype='object')

In [25]:
df.columns

Index(['age', 'taile', 'sexe'], dtype='object')

In [27]:
df.values

array([[25, 160, 'f'],
       [30, 175, 'h'],
       [35, 170, 'h'],
       [40, 180, 'f']], dtype=object)

In [29]:
df.head()

      age  taile sexe
liz    25    160    f
bob    30    175    h
bill   35    170    h
eve    40    180    f

In [31]:
df.tail(2)

      age  taile sexe
bill   35    170    h
eve    40    180    f

In [33]:
df.describe()

             age       taile
count   4.000000    4.000000
mean   32.500000  171.250000
std     6.454972    8.539126
min    25.000000  160.000000
25%    28.750000  167.500000
50%    32.500000  172.500000
75%    36.250000  176.250000
max    40.000000  180.000000

In [35]:
df.taile

liz     160
bob     175
bill    170
eve     180
Name: taile, dtype: int64

In [49]:
type(df['taile'])

pandas.core.series.Series

In [47]:
type(df[['taile']])

pandas.core.frame.DataFrame

In [59]:
df2 = (df.reset_index()
      .rename(columns={'index': 'prenom'}))

In [61]:
df2

  prenom  age  taile sexe
0    liz   25    160    f
1    bob   30    175    h
2   bill   35    170    h
3    eve   40    180    f

In [71]:
df1 = pd.DataFrame(np.ones((2,2)), index=list('ab'), columns=list('xy'))

In [73]:
df2 = pd.DataFrame(np.ones((2,2)), index=list('ac'), columns=list('xz'))

In [75]:
df1+df2

     x   y   z
a  2.0 NaN NaN
b  NaN NaN NaN
c  NaN NaN NaN

In [77]:
df1.add(df2, fill_value=0)

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0  NaN
c  1.0  NaN  1.0

In [79]:
df1

     x    y
a  1.0  1.0
b  1.0  1.0

In [81]:
df2

     x    z
a  1.0  1.0
c  1.0  1.0

In [83]:
df = df1.add(df2, fill_value=0)

In [85]:
df.fillna(-1)

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0 -1.0
c  1.0 -1.0  1.0

In [87]:
df.dropna()

     x    y    z
a  2.0  1.0  1.0